rails/mini_crm/app/views/notes/_note.html.erb

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = 4 LIMIT 1
---
    <strong class="block font-medium mb-1">Contact:</strong>
    <%= note.contact.present? ? note.contact.name : note.contact_id %>

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
---

  <% if note.user.present? %>