rails/mini_crm/app/views/notes/edit.html.erb

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = 2 LIMIT 1
---
        <div class="space-y-2 text-sm">
          <% if @note.contact.email.present? %>