rails/mini_crm/app/views/notes/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
---
              <%= note.created_at.strftime("%d.%m.%Y %H:%M") %>
              <% if note.user.present? %>

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = 4 LIMIT 1
---
              <% end %>
              <% if note.contact.present? %>