rails/mini_crm/app/views/notes/index.html.erb

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = 9 LIMIT 1
---
          <!-- Contact info -->
          <% if note.contact.present? %>

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
---
            <span><%= note.created_at.strftime("%d.%m.%Y %H:%M") %></span>
            <% if note.user.present? %>