rails/mini_crm/app/views/notes/show.html.erb

        </div>
        <% if @note.user.present? %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1