rails/mini_crm/app/views/notes/show.html.erb

      Created at: <%= @note.created_at.strftime("%d.%m.%Y %H:%M") %>
      <% if @note.user.present? %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1