rails/mini_crm/app/controllers/chat_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 4 ORDER BY "users"."id" ASC LIMIT 1
---
  def create
    @message = params[:message]

    begin
      client = OpenRouterClient.new
      response = client.chat(@message)

      if response.success?
        generated_code = response.dig("choices", 0, "message", "content")
        # Wrap the code to scope it to current user's data
        scoped_code = <<-RUBY
          User.current = User.find(#{current_user.id})