rails/mini_crm/app/controllers/contacts_controller.rb

  def index
    if params[:q].present?
      query = "%#{params[:q]}%"
      @contacts = Contact.where("LOWER(name) LIKE ? OR LOWER(email) LIKE ? OR LOWER(company) LIKE ?", query.downcase, query.downcase, query.downcase)
    else
      @contacts = Contact.all
---
SELECT "contacts".* FROM "contacts" WHERE (LOWER(name) LIKE '%a%' OR LOWER(email) LIKE '%a%' OR LOWER(company) LIKE '%a%')
SELECT "contacts".* FROM "contacts"

  def show
    @notes = @contact.notes.order(created_at: :desc)
---
SELECT "notes".* FROM "notes" WHERE "notes"."contact_id" = 1 ORDER BY "notes"."created_at" DESC

  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save
---
INSERT INTO "contacts" ("name", "email", "phone", "company", "created_at", "updated_at", "birthday", "last_contacted_at") VALUES ('1', '', '1', '1', '2025-05-29 21:52:33.865649', '2025-05-29 21:52:33.865649', NULL, NULL) RETURNING "id"

  def update
    respond_to do |format|
      if @contact.update(contact_params)
---
UPDATE "contacts" SET "updated_at" = '2025-05-29 21:53:24.740740', "birthday" = '1111-11-11' WHERE "contacts"."id" = 2

  def destroy
    @contact.destroy!
---
DELETE FROM "contacts" WHERE "contacts"."id" = 3

    def set_contact
      @contact = Contact.find(params.expect(:id))
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = 2 LIMIT 1