rails/mini_crm/app/controllers/contacts_controller.rb

  def create
    @contact = Contact.new(contact_params)
    @contact.user = current_user

    respond_to do |format|
      if @contact.save
---
INSERT INTO "contacts" ("name", "email", "phone", "company", "created_at", "updated_at", "birthday", "last_contacted_at", "user_id", "active") VALUES ('Standa', 'Standa@lotous.cz', '', 'Standa vlasy', '2025-06-02 23:15:43.114075', '2025-06-02 23:15:43.114075', NULL, NULL, 3, NULL) RETURNING "id"

  def update
    respond_to do |format|
      if @contact.update(contact_params)
---
UPDATE "contacts" SET "name" = 'Honza Novák', "email" = 'Honza@trouba.cz', "updated_at" = '2025-06-05 01:11:52.609657' WHERE "contacts"."id" = 10

  def destroy
    @contact.destroy!
---
DELETE FROM "contacts" WHERE "contacts"."id" = 8

    def set_contact
      @contact = current_user.contacts.find(params[:id])
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."user_id" = 3 AND "contacts"."id" = 10 LIMIT 1