rails/mini_crm/app/controllers/notes_controller.rb

SELECT "notes".* FROM "notes"
---
  def index
    @notes = Note.all

INSERT INTO "notes" ("content", "contact_id", "created_at", "updated_at") VALUES ('test', 2, '2025-05-29 19:46:53.206597', '2025-05-29 19:46:53.206597') RETURNING "id"
UPDATE "contacts" SET "updated_at" = '2025-05-29 19:47:08.902294', "last_contacted_at" = '2025-05-29 19:47:08.901927' WHERE "contacts"."id" = 2
---
  def create
   @note = Note.new(note_params)
   if @note.save
    contact = @note.contact
    contact.update(last_contacted_at: Time.current)

UPDATE "notes" SET "content" = 'aaaa', "updated_at" = '2025-05-29 19:11:23.347106' WHERE "notes"."id" = 2
---
  def update
    respond_to do |format|
      if @note.update(note_params)

SELECT "notes".* FROM "notes" WHERE "notes"."id" = 3 LIMIT 1
DELETE FROM "notes" WHERE "notes"."id" = 3
---
  def destroy
    @note = Note.find(params[:id])
    contact = @note.contact
    @note.destroy!

SELECT "notes".* FROM "notes" WHERE "notes"."id" = 2 LIMIT 1
---
    def set_note
      @note = Note.find(params.expect(:id))