rails/mini_crm/app/controllers/notes_controller.rb

  def index
    @notes = current_user.notes.includes(:contact).order(created_at: :desc)
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" IN (10, 9)
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = 3 ORDER BY "notes"."created_at" DESC

  def new
    if params[:contact_id].present?
      @contact = current_user.contacts.find(params[:contact_id])
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = 1 LIMIT 1

  def create
    if params[:contact_id].present?
      # Creating note from contact page
      @contact = current_user.contacts.find(params[:contact_id])
      @note = @contact.notes.build(note_params)
      @note.user = current_user

      if @note.save
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = 10 LIMIT 1
INSERT INTO "notes" ("content", "contact_id", "created_at", "updated_at", "user_id") VALUES ('Osobní schůzka', 10, '2025-06-05 01:33:58.382152', '2025-06-05 01:33:58.382152', 3) RETURNING "id"

  def update
    if @note.update(note_params)
---
UPDATE "notes" SET "content" = 'aaaa', "updated_at" = '2025-05-29 19:11:23.347106' WHERE "notes"."id" = 2

  def destroy
    @note.destroy!
---
DELETE FROM "notes" WHERE "notes"."id" = 1

    def set_note
      @note = current_user.notes.find(params[:id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = 14 LIMIT 1