rails/mini_crm/app/models/note.rb

UPDATE "contacts" SET "updated_at" = '2025-06-02 19:31:56.623657', "last_contacted_at" = '2025-06-02 19:31:56.621357' WHERE "contacts"."id" = 7
---
  def update_contact_last_contacted_at
    contact.update(last_contacted_at: created_at)