rails/mini_crm/app/views/contacts/index.html.erb

              </svg>
              <span><%= contact.notes.count %> <%= contact.notes.count == 1 ? 'poznámka' : contact.notes.count.between?(2, 4) ? 'poznámky' : 'poznámek' %></span>
            </div>
            <% if contact.notes.any? %>
---
SELECT "notes".* FROM "notes" WHERE "notes"."contact_id" = 9 ORDER BY "notes"."created_at" DESC LIMIT 1
SELECT COUNT(*) FROM "notes" WHERE "notes"."contact_id" = 9
SELECT 1 AS one FROM "notes" WHERE "notes"."contact_id" = 9 LIMIT 1

                </svg>
                <p class="text-xs leading-relaxed"><%= truncate(contact.notes.order(created_at: :desc).first.content, length: 80) %></p>
---
SELECT "notes".* FROM "notes" WHERE "notes"."contact_id" = 9 ORDER BY "notes"."created_at" DESC LIMIT 1