rails/mini_crm/app/views/contacts/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
---
                  <span><%= note.created_at.strftime("%d.%m.%Y %H:%M") %></span>
                  <% if note.user.present? %>