rails/mini_crm/app/views/contacts/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
---
      <%= note.created_at.strftime("%d.%m.%Y %H:%M") %>
      <% if note.user.present? %>